//=====================================================================================================================
// Проект: Lotus.Web
// Раздел: Общий модуль
// Подраздел: Подсистема аккаунта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWebAccountLoginParameters.cs
*		Класс определяющий минимально необходимые параметры для аутентификации.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel.DataAnnotations;
using System.Linq;
using System.Threading.Tasks;
//=====================================================================================================================
namespace Lotus.Web
{
	namespace Account
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WebCommonAccount
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс определяющий минимально необходимые параметры для аутентификации
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CLoginParameters
		{
			/// <summary>
			/// Имя пользователя
			/// </summary>
			[Required]
			[Display(Name = "Имя пользователя")]
			public String UserName { get; set; }

			/// <summary>
			/// Пароль
			/// </summary>
			[Required]
			[DataType(DataType.Password)]
			[Display(Name = "Пароль")]
			public String Password { get; set; }

			/// <summary>
			/// Запомнить меня
			/// </summary>
			/// <remarks>
			/// Параметры пользователя сохраняются в куках
			/// </remarks>
			[Required]
			[Display(Name = "Запомнить меня")]
			public Boolean RememberMe { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================