//=====================================================================================================================
// Проект: Lotus.Web
// Раздел: Общий модуль
// Подраздел: Подсистема аккаунта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWebAccountAuthorizeInfo.cs
*		Класс определяющий минимальную информацию об авторизации пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel.DataAnnotations;
using System.Linq;
using System.Security.Claims;
using System.Threading.Tasks;
//=====================================================================================================================
namespace Lotus.Web
{
	namespace Account
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WebCommonAccount
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс определяющий минимальную информацию об авторизации пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CUserAuthorizeInfo
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Статус авторизации пользователя
			/// </summary>
			public Boolean IsAuthenticated { get; set; }

			/// <summary>
			/// Имя пользователя
			/// </summary>
			public String UserName { get; set; }

			/// <summary>
			/// Словарь требований данного пользователя
			/// </summary>
			public Dictionary<String, String> ExposedClaims { get; set; }
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CUserAuthorizeInfo()
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="claims_principal">Объект пользователя</param>
			//---------------------------------------------------------------------------------------------------------
			public CUserAuthorizeInfo(ClaimsPrincipal claims_principal)
			{
				IsAuthenticated = claims_principal.Identity.IsAuthenticated;
				UserName = claims_principal.Identity.Name;
				ExposedClaims = claims_principal.Claims.ToDictionary(c => c.Type, c => c.Value);
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================