//=====================================================================================================================
// Проект: Lotus.Web
// Раздел: Общий модуль
// Подраздел: Подсистема аккаунта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWebAccountUserPost.cs
*		Класс для определения должности пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Web
{
	namespace Account
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WebCommonAccount
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения должности пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CPost : CNameableId
		{
			#region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конфигурирование модели для типа <see cref="CPost"/>
			/// </summary>
			/// <param name="model_builder">Интерфейс для построения моделей</param>
			//---------------------------------------------------------------------------------------------------------
			public static void ModelCreating(ModelBuilder model_builder)
			{
				// Определение для таблицы
				var model = model_builder.Entity<CPost>();
				model.ToTable("AspUserPost");				// Имя таблицы
				model.HasKey(vs => vs.Id);					// Первичный ключ
				model.HasIndex(vs => vs.Id).IsUnique();     // Для увеличения производительности поиска в базе данных применяются индексы. Уникальность индексов
				model.Ignore(vs => vs.InspectorObjectName); // Игнорируем указанные свойства
				model.Ignore(vs => vs.InspectorTypeName);   // Игнорируем указанные свойства

				// Определение для свойства
				var property_name = model.Property(vs => vs.Name);
				property_name.HasColumnName("names");       // Сопоставление с именем столбца
				property_name.HasMaxLength(140);			// Максимальная длина поля
				property_name.IsRequired();                 // Поле обязательно должно иметь значение

				// Определение для свойства
				var property_id = model.Property(vs => vs.Id);
				property_id.HasColumnName("id");            // Сопоставление с именем столбца

				// Определение для свойства
				var property_sname = model.Property(vs => vs.ShortName);
				property_sname.HasColumnName("sname");      // Сопоставление с именем столбца
				property_sname.HasMaxLength(40);            // Максимальная длина поля

				// Данные
				model.HasData(
					new CPost() { Id = 1, Name = "Инспектор", ShortName = "Инспектор" },
					new CPost() { Id = 2, Name = "Старший инспектор", ShortName = "Старший инспектор" },
					new CPost() { Id = 3, Name = "Ведущий специалист", ShortName = "Ведущий специалист" },
					new CPost() { Id = 4, Name = "Начальник отдела", ShortName = "Начальник отдела" },
					new CPost() { Id = 5, Name = "Начальник управления", ShortName = "Начальник управления" },
					new CPost() { Id = 6, Name = "Заместитель начальник управления", ShortName = "Заместитель начальник управления" },
					new CPost() { Id = 7, Name = "Заместитель главы", ShortName = "Заместитель главы" }
					);
			}
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Краткое наименование должности
			/// </summary>
			public String ShortName { get; set; }

			/// <summary>
			/// Все пользователи
			/// </summary>
			public List<CUser> Users { get; set; }
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CPost()
				: base()
			{
				Users = new List<CUser>();
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="post">Наименование должности</param>
			//---------------------------------------------------------------------------------------------------------
			public CPost(String post)
				: base(post)
			{
				Users = new List<CUser>();
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================