//=====================================================================================================================
// Проект: Lotus.Web
// Раздел: Общий модуль
// Подраздел: Подсистема аккаунта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWebAccountUserFieldActivity.cs
*		Класс для определения сферы деятельности пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Web
{
	namespace Account
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WebCommonAccount
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения сферы деятельности пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CFieldActivity : CNameableId
		{
			#region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конфигурирование модели для типа <see cref="CFieldActivity"/>
			/// </summary>
			/// <param name="model_builder">Интерфейс для построения моделей</param>
			//---------------------------------------------------------------------------------------------------------
			public static void ModelCreating(ModelBuilder model_builder)
			{
				// Определение для таблицы
				var model = model_builder.Entity<CFieldActivity>();
				model.ToTable("AspUserFieldActivity");      // Имя таблицы
				model.HasKey(vs => vs.Id);                  // Первичный ключ
				model.HasIndex(vs => vs.Id).IsUnique();     // Для увеличения производительности поиска в базе данных применяются индексы. Уникальность индексов
				model.Ignore(vs => vs.InspectorObjectName); // Игнорируем указанные свойства
				model.Ignore(vs => vs.InspectorTypeName);   // Игнорируем указанные свойства

				// Определение для свойства
				var property_name = model.Property(vs => vs.Name);
				property_name.HasColumnName("names");       // Сопоставление с именем столбца
				property_name.HasMaxLength(140);            // Максимальная длина поля
				property_name.IsRequired();                 // Поле обязательно должно иметь значение

				// Определение для свойства
				var property_id = model.Property(vs => vs.Id);
				property_id.HasColumnName("id");            // Сопоставление с именем столбца

				// Определение для свойства
				var property_sname = model.Property(vs => vs.ShortName);
				property_sname.HasColumnName("sname");         // Сопоставление с именем столбца
				property_sname.HasMaxLength(40);               // Максимальная длина поля

				// Данные
				model.HasData(
					new CFieldActivity() { Id = 1, Name = "Жилищно-коммунальное хозяйство", ShortName = "ЖКХ" },
					new CFieldActivity() { Id = 2, Name = "Инженерная инфраструктура", ShortName = "Инженерия" },
					new CFieldActivity() { Id = 3, Name = "Дорожная деятельность", ShortName = "Дороги" },
					new CFieldActivity() { Id = 4, Name = "Архитектура", ShortName = "Архитектура" }
					);
			}
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Краткое наименование сферы деятельности
			/// </summary>
			public String ShortName { get; set; }

			/// <summary>
			/// Все пользователи
			/// </summary>
			public List<CUser> Users { get; set; }
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CFieldActivity()
				: base()
			{
				Users = new List<CUser>();
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="field_activity">сферы деятельности</param>
			//---------------------------------------------------------------------------------------------------------
			public CFieldActivity(String field_activity)
				: base(field_activity)
			{
				Users = new List<CUser>();
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================