//=====================================================================================================================
// Проект: LotusLocalSelfGovernment
// Раздел: Базовый модуль
// Подраздел: Подсистема субъектов гражданских правоотношений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusLSGSubjectCivilCommon.cs
*		Общие типы и структуры данных подсистемы субъектов гражданских правоотношений.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.IO;
using System.Collections.Generic;
using System.ComponentModel;
using System.Globalization;
using System.Xml;
using System.Xml.Serialization;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace LSG
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup MunicipalityBaseSubjectCivil Подсистема субъектов гражданских правоотношений
		//! Подсистема субъектов гражданских правоотношений определяет типы и параметры субъектов гражданских правоотношений.
		//! \ingroup MunicipalityBase
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовый тип субъекта гражданских правоотношений
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[TypeConverter(typeof(EnumToStringConverter<TSubjectCivilType>))]
		public enum TSubjectCivilType
		{
			/// <summary>
			/// Физическое лицо
			/// </summary>
			[Description("Физическое лицо")]
			Person = 0,

			/// <summary>
			/// Юридическое лицо
			/// </summary>
			[Description("Юридическое лицо")]
			LegalEntity = 1,

			/// <summary>
			/// Орган публичной власти
			/// </summary>
			[Description("Орган публичной власти")]
			Public = 2
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================
